{
  "partition": null,
  "name": "AI_Investing",
  "sections": [
    {
      "id": 0,
      "start": "0:00:00",
      "end": "0:00:45.045",
      "content": "[Video title] AI_Investing\n[Tags] Beginning\n[Visual labels] human face, person, clothing, glasses, man\n[OCR] 74, Bloomberg, Cross Currency Rates, ency Rates, gies Announce\n[Transcript] Alexis, give me the 776 thesis on investing in AI.\nWell, look, there's a lot of hype right now.\nI've been investing in the space for over a decade, back when it was just narrow AI companies, you know, seating companies like a fellas and Cruz.\nSo this is really now a big breakthrough.\nGeneralized AI is a giant buzzword, but there is some real special truth there.\nAnd we're looking for companies that are using this technology to enhance the user experience and outsize ways.\nIt really is.\nAs simple as that, and we're seeing it across the portfolio from AI produced dubbing like Deep Tune to sports media management companies like Score Plates.\nIt's not about just the buzzword, it's about how are you improving users lives using this technology effortlessly.\nWhen I was looking through the portfolio, you know the examples of score Play and deep tune you, you kind of split it maybe into a tool, an AI tool which we call generative AI and then an existing technology platform which is kind of improved or added to using AI."
    },
    {
      "id": 1,
      "start": "0:00:45.045",
      "end": "0:02:35.321833",
      "content": "[Video title] AI_Investing\n[Tags] Beginning\n[Visual labels] human face, person, clothing, glasses, suit, man\n[OCR] 74, .74, Bloomberg, Cross Currency Rates, gies Announce, Rates, cy Rates\n[Transcript] You know, explain to us why score, Play and deep tune fit those two kind of categories, and why you'd invested in them.\nFor sure.\nWell, you know, as the owner of two professional sports teams, I know how important media management is and this process of actually capturing the clips, the photos or everything happening on the pitch or in the stands.\nAnd then.\nYou know, getting those out to the athletes, to social media, to your media partners, that is a ton of work and software should automatically, be able to seamlessly make all that happen way more effectively.\nBut now you layer in AI and you have something that now does it 10 times faster.\nWhether it's identifying, you know, this is Sydney LaRue, this is her kicking a goal, this is the DoorDash logo visible.\nAnd so all of that stuff can now be automated away, and so smaller teams can get far more done.\nAnd it's not reinventing a whole new technology.\nIt's leveling up existing software that already has deep relationships with customers.\nAnd so there are going to be these types of companies that have strong moats and lock in that are going to win and you know there's going to be big winners in this space as well.\nChatGPT is probably the most famous one, which I'm not investor in, though I really should have bugged Sam about that a lot earlier.\nYou know, I use it to tell bedtime stories with my daughter.\nAnd so you're seeing this very generalized, you know approach from an LLM like Open AI that's going to solve a lot of problems for a lot of people and then much more specific approaches that are solving at least right now strong business needs and you know, offering it like any other subscription as a service business.\nJust real quick if you do bug."
    },
    {
      "id": 2,
      "start": "0:02:35.321833",
      "end": "0:03:41.854967",
      "content": "[Video title] AI_Investing\n[Tags] Beginning\n[Visual labels] human face, person, clothing, glasses, man, suit\n[OCR] 74, Bloomberg, Cross Currency Rates, Rates, Currency Rates, ADO\n[Transcript] Sam Altman, I reported last week that there's a tender offer underway, right?\nAnd there's pretty big, big blocks of shares on the secondaries market, yes, that you know value Open AI 8690 billion, more than 100 billion, some of the prospectus that I've seen.\nIs that a way for you to get in or do you just you just stay away from Open AI given its late growth stage?\nI am such an early investor.\nI want to be there at the point of Inception all the way to maybe the Series A that's that's when we like leading and running that first check.\nAt this stage, I still think there is value but it's not you know, it's above my pay grade.\nI I enjoy.\nI enjoy being super early and right, but you know, it's still.\nIt's going to continue to surprise us.\nI think what these technologies are able to do, and yes, there is a ton of hype, but I do think the sky is the limit.\nAnd I've known Sam since he did Y Combinator together back in 2005, and one thing he has never lacked is ambition.\nAnd so if if there's anyone who can turn this into, you know, what all the sort of hype is about, it would be him, Alexis, that that takes me to our first question from our Bloomberg technology audience."
    },
    {
      "id": 3,
      "start": "0:03:41.854967",
      "end": "0:04:16.122533",
      "content": "[Video title] AI_Investing\n[Tags] Beginning\n[Visual labels] human face, person, clothing, glasses\n[OCR] 74, .74, Bloomberg, Cross Currency Rates, ency Rates, gies Announce, Rates, inancial Techr, Rat, urrency\n[Transcript] You know, I I said on social media you were coming on the show.\nThis is an interesting one that was posted on X.\nHow do we score the efficiency and impact of artificial intelligence versus the impact of human intelligence?\nAnd this followers talking about the impact that like Sir Isaac Newton and Albert Einstein had on mankind over a series of decades.\nHow do we equate the impact that a eyes had in a much shorter space of time?\nWow, this is this is like the like who is the goat debate?\nIn sports I I think this is we are very much still living in this moment and so it's hard it's like we're still evaluating open AI and and generalized AI sort of mid season."
    },
    {
      "id": 4,
      "start": "0:04:16.122533",
      "end": "0:06:12.939233",
      "content": "[Video title] AI_Investing\n[Tags] Beginning-Middle\n[Visual labels] human face, person, clothing, man\n[OCR] Bloomberg\n[Transcript] But I don't think it would be unreasonable to say that this is on that order of magnitude and and what we're going to see here.\nI really hope you know I I am a tech optimist by default.\nI really do hope will help improve so many lives.\nYou know we a good example.\nYou know, while starting Reddit, my mother was diagnosed with a a terminal brain cancer.\nAnd you know, so many Americans are faced with life altering consequences where modern medicine really can't do very much.\nAnd we've had this amazing kismet where, you know, in the last couple of years the cost of sequencing an entire human genome has now plummeted to a few $100.\nIt is now trivial to get basically the mountain of data that are the building blocks of each and every one of us.\nAnd with a ton of data you have the chance to to make some great progress and solutions but you need the horsepower to analyze it and learn from it and and what kismet that now we have these also breakthroughs in AII really believe the next 10 years in medicine alone should be able to help us far better understand what what ails us be able to create some tremendous breakthroughs that I hope will save many many lives And you know these are the things where.\nIf we can look back on this technology being a a very significant, also very positive force in this world, I think medicine is going to be a big part of it.\nThat Nucleus is another company I've invested in along those same lines, I I really, really believe we will understand things 10 years from now thanks to these AI breakthroughs about our own bodies that will make what we consider today modern medicine actually look fairly basic or or or or pretty elementary by comparison.\nAlexis, you called yourself a tech optimist and and you were an early investor in in some companies that have IPO recently, right."
    },
    {
      "id": 5,
      "start": "0:06:12.939233",
      "end": "0:07:43.296167",
      "content": "[Video title] AI_Investing\n[Tags] Middle\n[Detected objects] necktie\n[Visual labels] human face, person, clothing, glasses, suit, man\n[OCR] 74, .74, Bloomberg, Cross Currency Rates, Currency Rates, XX, es Announce, XXX\n[Transcript] We had this kind of short fantastical 3 week.\nIn September and it kind of curtailed off.\nBut how did you read that IPO window in terms of what's to come?\nWell, you know, I was on another Business Network.\nAnd they asked me the same question or at least along the lines of, you know, is this, does this mean it's open season on IPOs?\nAnd I was very cautious in my answer and I'll continue to be cautious here.\nYou know, this economy still has to find its footing.\nThere's still a lot of of work to be done to get confidence back in the markets.\nBut what is so telling is, you know, having invested that was a partner at Y Combinator during the housing crisis, having invested through rough economic times, you know.\nAll of this tightness, I really believe will actually help create some of the best companies, because the companies getting started right now are the ones being forged in fire.\nThey're the ones who are not taking the next round of funding for granted.\nThey're the ones who know they have to solve real problems.\nThose are the companies are going to be really special.\nAnd so I I can't help but feel like even though.\nI think it's still going to, it's still going to be a little chilly here in the markets that that in the long run this is going to be seen as AI think a very fruitful time for new companies to get started and you know the IPO markets will open when they open.\nAnd again, I the joy of being an early stage investor is I don't have to dwell too much on the state of public markets.\nIt makes MNA kind of interesting as well."
    },
    {
      "id": 6,
      "start": "0:07:43.296167",
      "end": "0:09:06.1456",
      "content": "[Video title] AI_Investing\n[Tags] Middle\n[Detected objects] necktie\n[Visual labels] human face, person, clothing, glasses, suit, man\n[OCR] 74, .74, Bloomberg, Cross Currency Rates, gies Announce, Rates, Currency Rates, es Announce, inancial Tech, y Rates\n[Transcript] You know a lesson learned on Bloomberg technology this year is the especially in AI right that you can found a company that makes it kind of right to be acquired by a larger enterprise Oregon SAS company.\nWe've had some mega deals as well like Microsoft, Activision, you know it's a venture capitalists.\nHow do you feel about MA is an exit opportunity but the market broadly?\nYeah.\nIt's going to be AI think for a lot of companies, it will be a good landing.\nI think there's some great opportunistic acquisitions that are bound to happen loom.\nWas recently acquired for nearly a billion dollars.\nYou know that's a company I so I'm not an investor in it.\nI cannot live without it.\nAnd and it was a great outcome for the founders, for the early employees, for you know, early investors.\nAnd I know those things maybe don't get as much fanfare as an IPO, but I think there are some really healthy M and as of great products and great companies are going to get bought that are going to being good investments at least for the earlier stage investors.\nAnd and there'll be some other M and as that are basically soft landings for companies that you know never found product market fit or never quite found enough of it.\nSo it is a good time to have cash and a good time to be able to pick up some strong technologies and some strong teams.\nBut obviously not not the outcome that most investors are dreaming of when we when we when we write the check we're we're hoping for that IPO.\nLet's throw the kitchen sink of you, of you of sort of global technology markets while we have you great talk about Bitcoin."
    },
    {
      "id": 7,
      "start": "0:09:06.1456",
      "end": "0:09:24.7642",
      "content": "[Video title] AI_Investing\n[Tags] Middle\n[Detected objects] necktie\n[Visual labels] human face, person, clothing, glasses, man, smile\n[OCR] 74, .74, Bloomberg, Cross Currency Rates, Financial Tech, rency Rates\n[Transcript] You know, Bitcoin.\nInteresting.\nOK, well, are we back, you know, explain that that answer to me.\nI say it glibly.\nI mean, I, I look, I have, as you you referenced, I seeded Coinbase in 2012."
    },
    {
      "id": 8,
      "start": "0:09:24.7642",
      "end": "0:11:20.92",
      "content": "[Video title] AI_Investing\n[Tags] Middle\n[Visual labels] human face, person, clothing, man\n[OCR] Bloomberg\n[Transcript] So I have been in crypto for over a decade.\nI have invested through every single winter and none of them faze me.\nThey're all healthy because they sort of clear out the tourists and the grifters in in every sector, in every industry.\nAnd and I think here we're seeing a response to my guess a a sort of broader macro and global uncertainty.\nAnd what's wild is, I know for for some viewers it may seem a little surprising that people would find safety in a volatile cryptocurrency like Bitcoin.\nBut the fact that it is truly decentralized and and the fact that it is backed by conviction, you know, to me, Bitcoin has never felt really all that different from gold.\nYou know, if you explain to me that gold was really important part of human culture, I'd understand it.\nAs an Armenian, I I know I I for whatever reason just love, love gold.\nWe have, we have a cultural affinity for this shiny piece of metal, the shiny rock and and it's been built over years and years and years and there are plenty of investors who won't touch it because they feel like it's not a a great asset.\nBut there's a whole heck of a lot of people who have a strong cultural affinity for it.\nAnd I think Bitcoin is in a similar camp.\nMaybe it's a different generation, maybe it's more sort of technology oriented folks.\nBut at the end of the day, you know, I'm here, I'm investing in asteroid mining companies and one thing I'm certain of is we're never going to find a bunch of new Bitcoin on an asteroid.\nThere's a bunch of precious metals we will end up finding.\nBut at the end of the day, it's a it's a kind of asset that requires a a sort of conviction in it as a store value.\nAnd for a whole heck of a lot of people, there has been, at least as of yesterday, another flight to it.\nBut you know, look I.\nI invest with the long term horizon.\nThat's one of the nice things about this job is I don't have to worry about markets day-to-day or hour to hour.\nI make every investment with at least a 10 year time horizon and so I've been holding quite a bit Bitcoin, quite a bit of ETH as a result."
    },
    {
      "id": 9,
      "start": "0:11:20.92",
      "end": "0:12:07.259867",
      "content": "[Video title] AI_Investing\n[Tags] Middle\n[Detected objects] necktie\n[Visual labels] human face, person, clothing, man, glasses, suit\n[OCR] Bloomberg, 74, .74, Cross Currency Rates, Rates, Currency Rates, es Announce\n[Transcript] But again, not not investment advice or anything, just my mindset's been been very long term on this.\nSo there's Alexis the the investor and then there's Alexis the the Co founder and entrepreneur and there is an interest in in Reddit and and how you feel about it.\nOne of the audience, because questions we got was from StockTwits actually.\nAnd what they want to know from you is if there is something interesting being discussed within a specific subreddit or community on that platform, Is it the duty of Reddit to make that discoverable, to amplify it so that if it's interesting it can reach a broader audience?\nWhich, based on the mechanics of how Reddit works, was quite an interesting question.\nWell, OK.\nSo I obviously left very publicly three years ago."
    },
    {
      "id": 10,
      "start": "0:12:07.259867",
      "end": "0:14:12.92",
      "content": "[Video title] AI_Investing\n[Tags] Middle-End\n[Visual labels] human face, person, clothing, man\n[OCR] Bloomberg\n[Transcript] And so I'm really commenting here as an outsider.\nI One of the big shifts every social media company has has made in the last, call it, three or four years has been getting a smarter front page algorithm.\nYou know folks over at X have very aggressively tried to open source exactly how that works.\nFolks over at TikTok are you know anything but transparent with how that works.\nBut everyone has the same end game which is how do we make sure the content that our users see is what they want to see.\nAnd you know the the guiding metrics on that are ultimately around engagement.\nAnd so to answer that question, I do think.\nAlmost all platforms engage in some version of this.\nInteresting though is a tricky word, right?\nBecause interesting this is truly in the eyes of the beholder and and I think one thing that's been very clear is that every social media platform would like to be absolved of the responsibility of determining importance.\nOne of the reasons these these companies I mean the one of the founding principles of Reddit.\nThat I scrawled on a on a poster that I put up around Cambridge was this idea that we would be creating a front page of the Internet that would be decided by users, not a small group of editors.\nAnd you know, there's two sides to that for sure, that one of the big advantages is the fact that it is an accurate representation of what people are most interested in.\nThe downside is it's not always the things that the editors and the folks in charge feel are the most important things.\nAnd so we're in the middle of.\nA tremendous moment here where I think we will see, I hope we'll see the collective consciousness of us now adapting to a world where real time information is now so global and unfettered.\nAny one of us at any time we can get a glimpse into a world that is, you know, sort of exactly tailored to get a reaction out of us, which brings out both both the best and the worst in US.\nAnd I actually think.\nMy hope is the way this plays out is in another year or two slow news will make a comeback."
    },
    {
      "id": 11,
      "start": "0:14:12.92",
      "end": "0:15:15.0141",
      "content": "[Video title] AI_Investing\n[Tags] End\n[Visual labels] human face, person, clothing, man\n[OCR] Bloomberg\n[Transcript] I my my personal plea too as a as a as a person who wants to be well informed is, is that we can get back to a world where there is a real premium paid on institutions that want to do the work to basically say, look, we're going to we're going to figure out what the heck is happening here, synthesize it, do the research and then inform.\nBecause trying to keep up with the daily cacophony on social no one will ever win.\nNo single institution can keep up with the real time speed of user generated content.\nAnd it's important for thoughtful voices to actually sit through and say, OK, what's real, what isn't?\nHow do we best inform folks and how do we build a brand around that?\nNow, I I'm not pandering here, I feel Bloomberg does a pretty good job of that actually.\nBut it's hard because you're also still trying to fill, you know, 24/7 television space.\nBut at the end of the day, I do think I hope a kind of slow news gets a renaissance here because I think we're at peak UGC and we just can't we can't keep up.\nYeah, we want Bloomberg Technology to be the global home of technology news information from from what is such a broad topic."
    },
    {
      "id": 12,
      "start": "0:15:15.0141",
      "end": "0:15:44.5436",
      "content": "[Video title] AI_Investing\n[Tags] End\n[Detected objects] necktie\n[Visual labels] human face, person, clothing, glasses, suit\n[OCR] 74, .74, Bloomberg, Cross Currency Rates, Currency Rates, es Announce, Da, Announce\n[Transcript] Look, Alexis, we've talked about Alexis the investor, the founder, that there's also the philanthropic focus that you have.\nYou're in New York City for Robin Hood, Yes.\nCan you explain to us your relationship with that organization and why New York City families are important to you?\nOf course.\nWell, I was very fortunate to be born here in New York at Saint Vincent's Hospital."
    },
    {
      "id": 13,
      "start": "0:15:44.5436",
      "end": "0:17:48",
      "content": "[Video title] AI_Investing\n[Tags] End\n[Visual labels] human face, person, clothing, man\n[OCR] Bloomberg\n[Transcript] It was a product of 4 Green, Brooklyn and.\nYou know, I was very lucky.\nBoth my parents you know, were able to to give me opportunities and I I feel very, very grateful for that chance that I got.\nAnd I had an amazing, great Aunt Vera who was a public school teacher her entire career didn't have any kids, but I was her, essentially her, her kid.\nAnd and all the time she spent taking care of me, looking after me, I I know was was important because you know, while both my parents worked.\nAnd so early childcare was something I I got to take for granted, frankly.\nAnd, you know, I got together with the folks at Robin Hood, got to know Paul Tudor Jones, the amazing executive team there.\nAnd a couple of years ago said I want to do something that can be a way to give back to the city and be a way to ensure that this is an opportunity afforded to every New Yorker, especially the most vulnerable.\nSo, you know, early childhood development is so, so, so crucial.\nProviding platforms for care and support for the the most vulnerable New Yorkers is so, so, so critical.\nAnd so I and then along with the the mayor's office, the Bezos Family Foundation, you know, so I I put forward a $25 million gift to to the city and to build out some great childcare initiatives.\nAnd you know I've I've only gotten more and more impressed with Robin Hood as I've spent more time with them.\nBeen privileged enough to be on the board now.\nAnd so here we are in town for a big event, the the annual Robin Hood investors conference and I'll be doing some fun AI demos, no surprise.\nI'll also have a surprise guest pretty important person in the AI world who I may have referenced earlier in this interview and and we'll be sharing the the the frontline stories where this is all headed and you know I want.\nSo much for my legacy that my two daughters now will know about me to to not be about Reddit.\nAnd that's not to say I'm not not proud of what we built there.\nBut it's about the work that I'm doing now."
    },
    {
      "id": 14,
      "start": "0:17:48",
      "end": "0:18:12.2912",
      "content": "[Video title] AI_Investing\n[Tags] End\n[Visual labels] human face, person, clothing, man\n[OCR] Bloomberg\n[Transcript] And it's about the fact that I want them to see me doing my absolute best work and doing so in a way that aligns with my values and in a way that they can be proud of.\nAnd like I said, this is the greatest city on earth.\nThere's a lot of work to do here.\nAnd I know Robin Hood's, you know, one of the absolute best organizations getting monies in the hands of folks that are doing the the good work to improve and and taking a very data-driven approach to it, which you, you know, I love."
    }
  ]
}
